Code "BossBitConfig-11243229042025"
//
	#include "Reflection" noemit
	#lib "Reflection"
	#lib "BossBitConfig"
	#lib "BlackboardStatus"
	#import "Services"
	#import "GOComponents"
	#import "Graphics"
	#import "Plugins"
//
{
	string currentStage = LevelInfo.GetCurrentStageID();
	List<string> excludedStages = new List<string> {"w1r06"};
	
	if (LevelInfo.GetCurrentStageID() == "w1r06")
	{
		var BossBitConfigInfo = Reflection.GetDataInfo<BossBitConfig.Root>("boss_bit_param");
		if (BossBitConfigInfo.pData == null)
			return;

		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[21].param.flyMoveSpeed, 150.0f);
		
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].text.pValue, 8042);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.isParry, true);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.time, 3.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.angleSpeed, 10.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.bulletType, BossBitConfig.BulletType.Homing);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.rotAngle, 5.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.phaseRotTime, 10.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.shootSpeed, 175.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.addShootSpeed, 5.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.shootAccel, 5.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.shootAccelMax, 0.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.shootAccelDelay, 4.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.wayNum, 2);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.wayAngle, 180.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.shootTime, 2.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.phaseShootTime, 1.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.periodShootCoolTime, 1.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.homingAccuracy, 10.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.homingDelay, 1.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.homingLimitAngle, 0.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.waveRotationSpeed, 225.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[22].param.flyMoveSpeed, 150.0f);
		
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].text.pValue, 8028);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.isParry, true);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.time, 5.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.bulletType, BossBitConfig.BulletType.Laser);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.phaseRotTime, 1.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.shootNum, 0);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.shootSpeed, 0.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.shootAccelMax, 0.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.shootAccelDelay, 1.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.wayNum, 0);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.wayAngle, 1.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.shootTime, 5.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.phaseShootTime, 1.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.periodShootCoolTime, 1.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.homingDelay, 1.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.homingLimitAngle, 0.0f);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.isHomingLowFly, true);
		RFL_SET_PARAM(BossBitConfigInfo, smallBitPatternDatas[23].param.waveRotationSpeed, 32.0f);
	}
}

Library "BossBitConfig"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public struct LargeBitLaserParameter
    {
        [FieldOffset(0x00)] public float rangeMin;
        [FieldOffset(0x04)] public float rangeMax;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x2C)]
    public struct SmallBitLaserBulletParameter
    {
        [FieldOffset(0x00)] public float bulletRadius;
        [FieldOffset(0x04)] public float bulletMoveLimitDistance;
        [FieldOffset(0x08)] public float bitHp;
        [FieldOffset(0x0C)] public float rotDamageAngleSpeed;
        [FieldOffset(0x10)] public float rotDamageSize;
        [FieldOffset(0x14)] public float hitDamageNotAttackTime;
        [FieldOffset(0x18)] public float blowoffSpeed;
        [FieldOffset(0x1C)] public float outOfControlTime;
        [FieldOffset(0x20)] public float keepVelocity;
        [FieldOffset(0x24)] public float muzzleEffectMinTime;
        [FieldOffset(0x28)] public byte dropRingNum;
    }

    [StructLayout(LayoutKind.Explicit, Size = 8)]
    public struct UnmanagedString
    {
        [FieldOffset(0)] public long pValue;

        public string Value
        {
            get
            {
                if (pValue == 0)
                    return string.Empty;

                return Marshal.PtrToStringAnsi((nint)pValue);
            }

            set => pValue = (long)Marshal.StringToHGlobalAnsi(value);
        }

        public UnmanagedString(string in_value)
        {
            Value = in_value;
        }

        public static implicit operator UnmanagedString(string in_value)
        {
            return new UnmanagedString(in_value);
        }

        public static bool operator ==(UnmanagedString in_left, string in_right)
        {
            return in_left.Value == in_right;
        }

        public static bool operator !=(UnmanagedString in_left, string in_right)
        {
            return !(in_left == in_right);
        }

        public override bool Equals(object in_obj)
        {
            if (in_obj is string str)
                return Value == str;

            return base.Equals(in_obj);
        }

        public override int GetHashCode()
        {
            return Value.GetHashCode();
        }

        public override string ToString()
        {
            return Value;
        }
    }

    public enum BulletType : byte
    {
        Normal = 0,
        Normal2 = 1,
        Laser = 2,
        Homing = 3
    }

    public enum RotType : byte
    {
        Rotation = 0,
        RoundTrip = 1,
        Aim = 2,
        Fix = 3
    }

    public enum CameraId : byte
    {
        Invalid = 0,
        Rotate = 1,
        Trace = 2,
        Sub = 3,
        Num = 4
    }

    public enum FormationId : byte
    {
        Default = 0,
        FanShaped = 1
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x64)]
    public struct SmallBitAttackPatternParameter
    {
        [FieldOffset(0x00)] public bool isParry;
        [FieldOffset(0x04)] public float time;
        [FieldOffset(0x08)] public float angleSpeed;
        [FieldOffset(0x0C)] public BulletType bulletType;
        [FieldOffset(0x0D)] public RotType rotType;
        [FieldOffset(0x10)] public float rotAngle;
        [FieldOffset(0x14)] public float phaseRotTime;
        [FieldOffset(0x18)] public uint shootNum;
        [FieldOffset(0x1C)] public float shootSpeed;
        [FieldOffset(0x20)] public float addShootSpeed;
        [FieldOffset(0x24)] public float shootAccel;
        [FieldOffset(0x28)] public float shootAccelMax;
        [FieldOffset(0x2C)] public float shootAccelDelay;
        [FieldOffset(0x30)] public byte wayNum;
        [FieldOffset(0x34)] public float wayAngle;
        [FieldOffset(0x38)] public float shootTime;
        [FieldOffset(0x3C)] public float phaseShootTime;
        [FieldOffset(0x40)] public uint periodShootCool;
        [FieldOffset(0x44)] public float periodShootCoolTime;
        [FieldOffset(0x48)] public float homingAccuracy;
        [FieldOffset(0x4C)] public float homingDelay;
        [FieldOffset(0x50)] public float homingLimitAngle;
        [FieldOffset(0x54)] public bool isHomingLowFly;
        [FieldOffset(0x55)] public CameraId overlookingId;
        [FieldOffset(0x58)] public float waveRotationSpeed;
        [FieldOffset(0x5C)] public float flyMoveSpeed;
        [FieldOffset(0x60)] public FormationId formationId;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x78)]
    public struct SmallBitSetPatternParameter
    {
        [FieldOffset(0x00)] public UnmanagedString text;
        [FieldOffset(0x10)] public SmallBitAttackPatternParameter param;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x10)]
    public struct SmallBitFormationFanShaped
    {
        [FieldOffset(0x00)] public float distance;
        [FieldOffset(0x04)] public float height;
        [FieldOffset(0x08)] public float radius;
        [FieldOffset(0x0C)] public float angleMax;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x1C)]
    public struct SmallBitFormationParameter
    {
        [FieldOffset(0x00)] public float changeTime;
        [FieldOffset(0x04)] public float changeDelay;
        [FieldOffset(0x08)] public float changeOffsetHeight;
        [FieldOffset(0x0C)] public SmallBitFormationFanShaped fanShaped;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x1E58)]
    public struct Root
    {
        [FieldOffset(0x00)] public LargeBitLaserParameter largeBitLaserParam;
        [FieldOffset(0x08)] public SmallBitLaserBulletParameter smallBitLaserParam;
        [FieldOffset(0x38)] public unsafe fixed byte /* SmallBitSetPatternParameter[64] */ _smallBitPatternDatas[7680];

        public unsafe SmallBitSetPatternParameter* smallBitPatternDatas
        {
            get
            {
                fixed (byte* p_smallBitPatternDatas = _smallBitPatternDatas)
                    return (SmallBitSetPatternParameter*)p_smallBitPatternDatas;
            }
        }

        [FieldOffset(0x1E38)] public SmallBitFormationParameter smallBitFormation;
    }

}
